close all
clear all
clc

%честота на дискретизация, в Hz:
Fd=433; 
%половината на честота на дискретизация:
Fn=Fd/2; 

%честоти на задържане в Hz:
Fs=[30 140]; 
%гранични честоти в Hz:
Fp=[60 108];

%гранична честота, в Hz:
Wp=Fp/Fn; 
%максимално затихване в ЛП, в dB:
Rp=1; 

%честота на задържане, в Hz:
Ws=Fs/Fn; 
%минимално затихване в ЛЗ, в dB:
Rs=30; 

%изчислява най-ниския възможен ред N и коригира честотата на задържане Wn:
[N,Wn]=cheb2ord(Wp,Ws,Rp,Rs); 
% N=4;
% Wn=[0.1386 0.6467];
printsys(N,Wn);

%връща полином в числителя Nz и полином в знаменателя Dz на ПФ:
[Nz,Dz]=cheby2(N,Rs,Wn); 
printsys(Nz,Dz);

%аналитичния израз на получената цифрова лентова предавателна функция (ПФ):
filt(Nz,Dz,1/Fn);
%     0.10288 s^8 - 0.11124 s^7 - 0.10391 s^6 + 0.0066004 s^5 + 0.21823 s^4 + 0.0066004 s^3 - 0.10391 s^2 - 0.11124 s + 0.10288
% Hz= -----------------------------------------------------------------------------------------------------------------------------
%            s^8 - 2.297 s^7 + 2.9384 s^6 - 2.824 s^5 + 2.3192 s^4 - 1.3311 s^3 + 0.53617 s^2 - 0.1661 s + 0.042253

figure(1)
%Изчертаване на утежнен габарит на ЛФ:

hold on
plot([0, 30], [30, 30],'--b');
plot([30, 30], [30, 0],'--b');
plot([60, 60], [1.5, 0],'--b');
plot([60, 108], [1, 1],'--b');
plot([108, 108], [1.5, 0],'--b');
plot([140, 140], [0, 30],'--b');
plot([140, 140+30], [30, 30],'--b');
title('Утежнен габарит на лентов филтър');
axis([0 170 0 30]);
xlabel('Честота, в Hz');
ylabel('Ампитуда, в dB');
hold off

%ПНД:
figure(2)
zplane(Nz,Dz);
title('ПНД на цифров ЛФ:');

%изчислява кръговата честота w и стойностите на предавателната функция в
%честотен вид T:
[T,w]=freqz(Nz,Dz);
%изчисляване на АЧХ в абсолютни единици и записва стойностите в матрица m:
m=abs(T);
%изчислява АЧХ в dB, като записва стойностите и в матрица m1:
m1=20*log10(abs(T));
%изчислява затихването в dB, като записва стойностите и в матрица a1:
a=-20*log10(abs(T));

%чертае затихването на ma логаритмична скала на честота:
%semilogx(w,a);

%Денормиране на затихването:
%L=Wn*Fd/(2*pi);

figure(3)
%Крива на затихването + габарита на лентовия филтър:

plot(w*Fd/(2*pi),a,'--r');

hold on
plot([0, 30], [30, 30],'--b');
plot([30, 30], [30, 0],'--b');
plot([60, 60], [1, 5],'--b');
plot([60, 108], [1, 1],'--b');
plot([108, 108], [1, 5],'--b');
plot([140, 140], [0, 30],'--b');
plot([140, 140+30], [30, 30],'--b');
title('Утежнен габарит на лентов филтър');
axis([0 210 0 80]);
hold off

xlabel('Честота, в Hz');
ylabel('Ампитуда, в dB');

figure(4)
%Фазова-честота характеристика:
fi=phasez(angle(T));
%semilogx(w,fi*180/pi);
plot(w,m);
xlabel('Честота, в deg');
ylabel('Амплитуда, в dB');
title('ФЧХ на цифров лентов филтър');
grid;

figure(5)
%Импулсна характеристика:
impz(Nz,Dz);
grid;
xlabel('Време, в sec');
ylabel('Амплитуда, Volts');
title('Импулсна характеристика на лентов филтър');


%Дефиниране на синусоидален сигнал, който филтъра пропуска:
n=(0:99)/Fd;

%Входен сигнал:
x1=2*sin(2*pi*45*n);

figure(6)
subplot(2,1,1);
plot(n*Fd,x1);
grid;
title('Входен сигнал x1(n)');
xlabel('Време');
ylabel('Амплитуда, във волти');

%Изходен сигнал:
y1=filter(Nz,Dz,x1);

subplot(2,1,2);
plot(n*Fd,y1);
grid;
title('Изходен сигнал y1(n)');
xlabel('Време');
ylabel('Амплитуда, във волти');

%Дефиниране на синусиодален сигнал, който филтъра не пропуска:
%Входен сигнал:
x2=2*sin(2*pi*15*n);

figure(7)
subplot(2,1,1);
plot(n*Fd,x2);
grid;
title('Входен сигнал x2(n)');
xlabel('Време');
ylabel('Амплитуда, във волти');

%Изходен сигнал
y2=filter(Nz,Dz,x2);

subplot(2,1,2);
plot(n*Fd,y2);
grid;
title('Изходен сигнал y2(n)');
xlabel('Време');
ylabel('Амплитуда, във волти');


%Трансофрмиране на цифрова лентова ПФ в аналогова чрез билинейно
%z-преобразуване:
[Ns,Ds]=bilinear(Nz,Dz,Fd);

%изчислява кръговата честота w1 и стойностите на предавателната функция в
%честотен вид T1:
[T1,w1]=freqs(Ns,Ds);
%изчисляване на АЧХ в абсолютни единици и записва стойностите в матрица m12:
m12=abs(T1);
%изчислява АЧХ в dB, като записва стойностите и в матрица m2:
m2=20*log10(abs(T1));

figure(7)

subplot(2,1,1);
plot(w,m1);
xlabel('Честота rad/s');
ylabel('Амплитуда');
title('АЧХ на цифорвата Hвр(z)');
grid;

subplot(2,1,2);
plot(w1,m2);
xlabel('Честота rad/s');
ylabel('Амплитуда');
title('АЧХ аналоговата Tвр(s)');
grid;
